# -*- org-publish-use-timestamps-flag: nil; -*-
#+TITLE: My Blog
#+AUTHOR: Preston Pan
#+DATE: <2023-06-14 Wed>
#+DESCRIPTION: List of all my blogs in alphabetical order
#+html_head: <link rel="stylesheet" type="text/css" href="../style.css" />
#+language: en
#+OPTIONS: broken-links:t
#+html_head: <meta name="viewport" content="width=1000; user-scalable=0;" />

* Why?
I want a place where I can write long form essays about subjects
without being constrained by any particular form, like in the mindmap.
** Why not the Journal, then?
This blog is not going to be for my personal life in any capacity,
technical or otherwise. Think about the blog like a mix between
the wiki format of the mindmap and the journal format.

Blog Articles:
@@html: <div class="links-page">@@
#+begin_src shell :results output raw :exports both
  for f in *;
  do
      if [[ "$f" == "index.org" || "$f" == "README.org" || "$f" == "emacs.el" ]]; then
          continue
      fi

      if [ -d "$f" ]; then
  	continue
      fi

      name="$(grep '^#+title:' "$f" | sed 's/^#+title:[[:space:]]*//')"
      printf -- "- [[file:$f][$name]]\n"
  done
#+end_src

#+RESULTS:
- [[file:automation.org][Automation, Hypocrisy, and Capitalism]]
- [[file:cognition.org][Cognition]]
- [[file:crypto.org][A Review of Cryptocurrency]]
- [[file:horses.org][Stop Asking for Better Horses]]
- [[file:machine_learning.org][Machine Learning is Here]]
- [[file:nixos.org][You should use NixOS]]
- [[file:private_keys.org][Passwords Are Obselete]]
- [[file:stem.org][Stem]]
- [[file:tech-bros.org][Tech Bros]]
- [[file:voting.org][Representative Voting]]
- [[file:you_dont_matter.org][You Don't Matter]]

@@html: </div>@@
